# Задача №19. Решение в группах
# Дана последовательность из N целых чисел и число
# K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо, K –
# положительное число.
# Input: [1, 2, 3, 4, 5] k = 3
# Output: [4, 5, 1, 2, 3]

from random import randint

size = randint(5, 10)
num = [randint(0, 10) for _ in range(size)]
print(f"Размер списка: {size}")
print(num)

k = randint(1, 20)
print(k)
k %= size
print(f"Смещение на {k} вправо")

# Первый метод ======================
# num2 = []
# for n in num[-k:]:
#     num2.append(n)
# for n in num[:-k]:
#     num2.append(n)
# ====================================

# Второй метод =======================
num2 = []
num2 = num[-k:] + num[:-k]
print(num2)
# ====================================